[
    {
        "role":"iOS Consultant",
        "company":"Fitness.AI",
        "summary":"Provided support services for reformatting and refactoring project for the CEO to continue being a sole developer with a better enviroment.",
        "range":"2021"
    },
    {
        "role":"iOS Lead",
        "company":"Cameo",
        "summary":"The sole native iOS developer on the team. Added support for async HD Video compression and real-time filters.",
        "range":"2020 - 2021"
    },
    {
        "role":"iOS Director",
        "company":"NewsCorp",
        "summary":"Directing iOS development across all NewsCorp brands include New York Post, NewsUK, The Australian, Barron's Group and more.",
        "range":"2019 - 2020"
    },
    {
        "role":"Lead Mobile Developer",
        "company":"SALIDO Inc.",
        "summary":"Led in development of industry leading mobile Point of Sales and Kitchen Display systems.",
        "range":"2018 - 2019"
    },
    {
        "role":"Lead Mobile Developer",
        "company":"Hearst Digital News",
        "summary":"Led in developing iOS/iPad apps and backend infrastructure for San Francisco Chronicle and other major market newspapers.",
        "range":"2012 - 2018"
    },
    {
        "role":"Lead iOS Developer",
        "company":"Sooloos Meridian (now Roon Labs).",
        "summary":"Porting of C#/OpenGL .NET premium audio stream application to the ground breaking, open-source, MonoMac project (now Microsoft Xamarin).",
        "range":"2010 - 2012"
    },
    {
        "role":"Lead iOS Developer / Hadoop Administrator",
        "company":"Sense Networks Inc. (Acquired by YellowPages.com)",
        "summary":"Developed patented machine learning, location based algorithms and applications for social media and financial investment markets.",
        "range":"2008 - 2010"
    },
    {
        "role":"Security Industry Consultant / Associate TV Producer",
        "company":"ATT (Bell Labs Park)",
        "summary":"Consulted for and associate produced original streaming content for ATT Tech Channel, producing shows with industry leaders such as; Richard Stallman (GNU), Whit Diffie (RSA), Bill Cheswick (Firewalls), Emmanuel Goldstein (Editor 2600 Magazine), H. D. Moore (Metasploit), Biz Stone and Jack Dorsey (Twitter Co-Founders), and more.",
        "range":"2007 - 2008"
    }
]
